PKS1C/src/Documents/ДневнойОтчетПочасовыхРабот/ДневнойОтчетПочасовыхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДневнойОтчетПочасовыхРабот</name>
  <registerRecords>InformationRegister.ПочасовыеРаботы</registerRecords>
  <registerRecords>InformationRegister.РаботыПоЗаявкам</registerRecords>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>ВремяПрибытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗавершения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Удаленка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сверхурочка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СоставРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкиКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

PKS1C/src/InformationRegisters/ПочасовыеРаботы/ПочасовыеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПочасовыеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Удаленка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сверхурочка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СоставРабот</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ВремяПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкиКлиентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/InformationRegisters/РаботыПоЗаявкам/РаботыПоЗаявкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботыПоЗаявкам</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СоставРабот</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <attributes>
    <name>ОбъемРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкиКлиентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/Documents/ДневнойОтчетПочасовыхРабот/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.АвторизованныйПользователь();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//Для Каждого ТекСтрокаДанные Из Данные Цикл
	//	Если ЗначениеЗаполнено(ТекСтрокаДанные.Заявка) Тогда
	//		Если Не ТекСтрокаДанные.Заявка.ОтветственноеЛицо = Исполнитель Тогда
	//			Сообщить("Ошибка! В строке " + ТекСтрокаДанные.НомерСтроки + " выбранная заявка была записана на другое физическое лицо");
	//			Отказ = Истина;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПочасовыеРаботы
	Движения.ПочасовыеРаботы.Записывать = Истина;
	Для Каждого ТекСтрокаДанные Из Данные Цикл
		Движение = Движения.ПочасовыеРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВремяПрибытия = ТекСтрокаДанные.ВремяПрибытия;
		Движение.ВремяЗавершения = ТекСтрокаДанные.ВремяЗавершения;
		Движение.Исполнитель = Исполнитель;
		Движение.Организация = ТекСтрокаДанные.Организация;
		Движение.Клиент = ТекСтрокаДанные.Клиент;
		Движение.Удаленка = ТекСтрокаДанные.Удаленка;
		Движение.Сверхурочка = ТекСтрокаДанные.Сверхурочка;
		Движение.СоставРабот = ТекСтрокаДанные.СоставРабот;
		Движение.Заявка = ТекСтрокаДанные.Заявка;
		Часы = (ТекСтрокаДанные.ВремяЗавершения - ТекСтрокаДанные.ВремяПрибытия)/60;
		Если ТекСтрокаДанные.Удаленка Тогда
			Движение.ВремяЗатраты = ПочасовкаУдаленка(Часы);
		Иначе
			Движение.ВремяЗатраты = ПочасовкаВыездная(Часы);
		КонецЕсли;
	КонецЦикла;


	// регистр РаботыПоЗаявкам
	Движения.РаботыПоЗаявкам.Записывать = Истина;
	Для Каждого ТекСтрокаДанные Из Данные Цикл
		Движение = Движения.РаботыПоЗаявкам.Добавить();
		Движение.Заявка = ТекСтрокаДанные.Заявка;
		Движение.ДатаИзменения = Дата;
		Движение.ВремяПрибытия = ТекСтрокаДанные.ВремяПрибытия;
		Движение.ВремяЗавершения = ТекСтрокаДанные.ВремяЗавершения;
		Движение.СоставРабот = ТекСтрокаДанные.СоставРабот;
		Движение.Исполнитель = Исполнитель;
		Движение.Клиент = ТекСтрокаДанные.Клиент;
		Движение.ОбъемРабот = ПолучитьОбъемРаботы(ТекСтрокаДанные.ВремяПрибытия,ТекСтрокаДанные.ВремяЗавершения,ТекСтрокаДанные.Удаленка);
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Функция ПочасовкаВыездная(ОбъемРабот)
	
	//Если специалист был на выезде меньше часавсеравно
	//время работы оценивается в 1 час
	Если ОбъемРабот <= 60 Тогда
		ЧасыРабот = 1;
		Возврат ЧасыРабот;
	Иначе
		//Разделяем целую и дробную часть времени работы
		Челое = Цел(ОбъемРабот/60);
		Хвостик = ОбъемРабот/60 - Цел(ОбъемРабот/60);
		//После одного часа работы тарификация считается по 
		//пол часа
		Если Хвостик = 0  Тогда
			ЧасыРабот = Цел(ОбъемРабот/60);
			Возврат ЧасыРабот;
		ИначеЕсли Хвостик <= 0.5  Тогда
			ЧасыРабот = Цел(ОбъемРабот/60) + 0.5;
			Возврат ЧасыРабот;
		Иначе
			ЧасыРабот = Цел(ОбъемРабот/60) + 1;
			Возврат ЧасыРабот;
		КонецЕсли;
		
	КонецЕсли; 
	
КонецФункции

Функция ПочасовкаУдаленка(ОбъемРабот)
	
	Если ОбъемРабот <= 30 Тогда
		ЧасыРабот = 0.5;
		Возврат ЧасыРабот;
	ИначеЕсли ОбъемРабот > 30 И ОбъемРабот <= 60 Тогда		
		ЧасыРабот = 1;
		Возврат ЧасыРабот;
	Иначе
		
		Челое = Цел(ОбъемРабот/60);
		Хвостик = ОбъемРабот/60 - Цел(ОбъемРабот/60);
		Если Хвостик = 0 Тогда
			ЧасыРабот = Цел(ОбъемРабот/60);
			Возврат ЧасыРабот;
		ИначеЕсли Хвостик > 0 И Хвостик <= 0.5 Тогда
			ЧасыРабот = Цел(ОбъемРабот/60) + 0.5;
			Возврат ЧасыРабот;
		Иначе
			ЧасыРабот = Цел(ОбъемРабот/60) + 1;
			Возврат ЧасыРабот;
		КонецЕсли;
		
	КонецЕсли; 
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ЗапросОтчета = Новый Запрос;
	ЗапросОтчета.Текст = 
		"ВЫБРАТЬ
		|	ДневнойОтчетПочасовыхРабот.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ДневнойОтчетПочасовыхРабот КАК ДневнойОтчетПочасовыхРабот
		|ГДЕ
		|	ДневнойОтчетПочасовыхРабот.Дата МЕЖДУ &От И &До
		|	И ДневнойОтчетПочасовыхРабот.Исполнитель = &Исполнитель";
	
	ЗапросОтчета.УстановитьПараметр("До", КонецДня(Дата));
	ЗапросОтчета.УстановитьПараметр("От", НачалоДня(Дата));
	ЗапросОтчета.УстановитьПараметр("Исполнитель", Исполнитель);
	
	РезультатЗапросаОтчета = ЗапросОтчета.Выполнить();
	
	ВыборкаОтчета = РезультатЗапросаОтчета.Выбрать();
	
	Если ВыборкаОтчета.Следующий() И Не ВыборкаОтчета.Ссылка = Ссылка Тогда
		Сообщить("ОШИБКА! На сегодня уже есть отчет почасовых работ.");
		Отказ = Истина;
	КонецЕсли;
	ОбъемРабот = ПолучитьОбъемРаботЗаДень();
КонецПроцедуры

Функция ПолучитьОбъемРаботЗаДень() Экспорт
	ИтогЧасов = 0;
	Для Каждого СтрокаТЧ Из Данные Цикл
		ИтогЧасов = ИтогЧасов + ПолучитьОбъемРаботы(СтрокаТЧ.ВремяПрибытия,СтрокаТЧ.ВремяЗавершения,СтрокаТЧ.Удаленка);
	КонецЦикла;
	Возврат ИтогЧасов;
КонецФункции
